#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments... Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # azurerm_availability_set.availability will be created + resource "azurerm_availability_set" "availability" { + id = (known after apply) + location = "westeurope" + managed = true + name = "aset-neolutin-01" + platform_fault_domain_count = 3 + platform_update_domain_count = 5 + resource_group_name = "rg-staging-neolutin-01" + tags = { + "Terraform" = "true" } } # azurerm_key_vault.main_kv will be created + resource "azurerm_key_vault" "main_kv" { + access_policy = (known after apply) + enabled_for_disk_encryption = true + id = (known after apply) + location = "westeurope" + name = "kv-neolutin-01" + purge_protection_enabled = false + resource_group_name = "rg-staging-neolutin-01" + sku_name = "standard" + soft_delete_enabled = (known after apply) + soft_delete_retention_days = 7 + tags = { + "Terraform" = "true" } + tenant_id = "7d409186-9e56-43bd-bd15-45bc8089fd18" + vault_uri = (known after apply) + network_acls { + bypass = "AzureServices" + default_action = "Allow" } } # azurerm_key_vault_access_policy.main_kv_open_policy will be created + resource "azurerm_key_vault_access_policy" "main_kv_open_policy" { + certificate_permissions = [] + id = (known after apply) + key_permissions = [ + "create", + "get", + "purge", + "recover", + "wrapKey", + "unwrapKey", ] + key_vault_id = (known after apply) + object_id = "6b678753-daf0-418c-a833-0806443a23be" + secret_permissions = [ + "Get", + "Set", + "Delete", + "Purge", ] + storage_permissions = [] + tenant_id = "7d409186-9e56-43bd-bd15-45bc8089fd18" } # azurerm_key_vault_key.vaultkey will be created + resource "azurerm_key_vault_key" "vaultkey" { + curve = (known after apply) + e = (known after apply) + id = (known after apply) + key_opts = [ + "decrypt", + "encrypt", + "sign", + "unwrapKey", + "verify", + "wrapKey", ] + key_size = 2048 + key_type = "RSA" + key_vault_id = (known after apply) + n = (known after apply) + name = "vaultkey" + public_key_openssh = (known after apply) + public_key_pem = (known after apply) + version = (known after apply) + versionless_id = (known after apply) + x = (known after apply) + y = (known after apply) } # azurerm_key_vault_secret.simple_user_password will be created + resource "azurerm_key_vault_secret" "simple_user_password" { + id = (known after apply) + key_vault_id = (known after apply) + name = "simplepassword" + value = (sensitive value) + version = (known after apply) + versionless_id = (known after apply) } # azurerm_network_security_group.vault will be created + resource "azurerm_network_security_group" "vault" { + id = (known after apply) + location = "westeurope" + name = "nsg-neolutin-01" + resource_group_name = "rg-staging-neolutin-01" + security_rule = [ + { + access = "Allow" + description = "" + destination_address_prefix = "10.0.2.0/24" + destination_address_prefixes = [] + destination_application_security_group_ids = [] + destination_port_range = "8200-8201" + destination_port_ranges = [] + direction = "Inbound" + name = "vault" + priority = 100 + protocol = "Tcp" + source_address_prefix = "*" + source_address_prefixes = [] + source_application_security_group_ids = [] + source_port_range = "*" + source_port_ranges = [] }, ] + tags = { + "Terraform" = "true" } } # azurerm_resource_group.main will be created + resource "azurerm_resource_group" "main" { + id = (known after apply) + location = "westeurope" + name = "rg-staging-neolutin-01" + tags = { + "Terraform" = "true" } } # azurerm_subnet.internal will be created + resource "azurerm_subnet" "internal" { + address_prefix = (known after apply) + address_prefixes = [ + "10.0.2.0/24", ] + enforce_private_link_endpoint_network_policies = false + enforce_private_link_service_network_policies = false + id = (known after apply) + name = "internal" + resource_group_name = "rg-staging-neolutin-01" + virtual_network_name = "vnet-neolutin-01" } # azurerm_virtual_network.main will be created + resource "azurerm_virtual_network" "main" { + address_space = [ + "10.0.0.0/16", ] + dns_servers = (known after apply) + guid = (known after apply) + id = (known after apply) + location = "westeurope" + name = "vnet-neolutin-01" + resource_group_name = "rg-staging-neolutin-01" + subnet = (known after apply) + tags = { + "Terraform" = "true" } + vm_protection_enabled = false } # random_password.password will be created + resource "random_password" "password" { + id = (known after apply) + length = 20 + lower = true + min_lower = 1 + min_numeric = 1 + min_special = 1 + min_upper = 1 + number = true + override_special = "_%@" + result = (sensitive value) + special = true + upper = true } # module.vm1.azurerm_linux_virtual_machine.main will be created + resource "azurerm_linux_virtual_machine" "main" { + admin_username = "adminuser" + allow_extension_operations = true + availability_set_id = (known after apply) + computer_name = (known after apply) + disable_password_authentication = true + extensions_time_budget = "PT1H30M" + id = (known after apply) + location = "westeurope" + max_bid_price = -1 + name = "vm1-neolutin-01" + network_interface_ids = (known after apply) + platform_fault_domain = -1 + priority = "Regular" + private_ip_address = (known after apply) + private_ip_addresses = (known after apply) + provision_vm_agent = true + public_ip_address = (known after apply) + public_ip_addresses = (known after apply) + resource_group_name = "rg-staging-neolutin-01" + size = "Standard_A1_v2" + tags = { + "Terraform" = "true" } + virtual_machine_id = (known after apply) + zone = (known after apply) + admin_ssh_key { + public_key = <<-EOT ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDBx48SGUdo6lra3pNytbYZUHaGbOk8ZIz6DLY8YkGsSsiI/i2S2F+D9geT+N5FCM/1KNhxnPXW/garkf3fjmsIzHnj+5K7CdGzOxNXRWySxAZ1DpcH74iAclUwcDwj/OYh+cpWkNPCZmjb0N2sLp9FFpJjhZGQmMU5KBDGN52BwyWMN5ES54+2/ZlxuqAW8EN+83XJ7f12m2yPxIQw1XE3GDzlNEoBLxbGEjq1ZEYL8XE5AcQaML9FjZyr5XM9k3QqdkedOFcdLEXRW+dZwxjfn6CIN9lH+hutnQL/kPfZ8H8GdwKCR271ed6BAXqece0g8qEageeWIq2s0IFSSRe5r5RUbUuEcfJKKwwuSVBwDyVSi4uky1KVaMHK5IXL0IgPRNOAblDBYncTPlqxWKp4UwWbPyz1ElF2R5GA5H4vwLdsIIACk6wbhPUFJyFtt+tKAM79YeySk1GlcKcFIAN8QEL+94GNtC4NNA/UD28WoddnHZ8FsV82r+5TDicHPulF7PZ67386kDvZpReZi9M1diR4B5LM7IPPFNZa0TISxgOcz783EFcUm6zoLajLqEMUr9rPVhjbzANJ0R9ohKHy97SPcaC9x9XJPK/hFn9FRTL8RHx7EfXgQR4D3+Ww9HHeqBMcJKFmBhjn7Rkj0niEfaPcppG9ULg9LoTvvLtN+w== vinz@Vinz-Laptop EOT + username = "adminuser" } + os_disk { + caching = "ReadWrite" + disk_size_gb = (known after apply) + name = (known after apply) + storage_account_type = "Standard_LRS" + write_accelerator_enabled = false } + source_image_reference { + offer = "UbuntuServer" + publisher = "Canonical" + sku = "18.04-LTS" + version = "latest" } } # module.vm1.azurerm_network_interface.internal will be created + resource "azurerm_network_interface" "internal" { + applied_dns_servers = (known after apply) + dns_servers = (known after apply) + enable_accelerated_networking = false + enable_ip_forwarding = false + id = (known after apply) + internal_dns_name_label = (known after apply) + internal_domain_name_suffix = (known after apply) + location = "westeurope" + mac_address = (known after apply) + name = "nic2-vm1-neolutin-01" + private_ip_address = (known after apply) + private_ip_addresses = (known after apply) + resource_group_name = "rg-staging-neolutin-01" + tags = { + "Terraform" = "true" } + virtual_machine_id = (known after apply) + ip_configuration { + gateway_load_balancer_frontend_ip_configuration_id = (known after apply) + name = "internal" + primary = (known after apply) + private_ip_address = (known after apply) + private_ip_address_allocation = "dynamic" + private_ip_address_version = "IPv4" + subnet_id = (known after apply) } } # module.vm1.azurerm_network_interface.main will be created + resource "azurerm_network_interface" "main" { + applied_dns_servers = (known after apply) + dns_servers = (known after apply) + enable_accelerated_networking = false + enable_ip_forwarding = false + id = (known after apply) + internal_dns_name_label = (known after apply) + internal_domain_name_suffix = (known after apply) + location = "westeurope" + mac_address = (known after apply) + name = "nic1-vm1-neolutin-01" + private_ip_address = (known after apply) + private_ip_addresses = (known after apply) + resource_group_name = "rg-staging-neolutin-01" + tags = { + "Terraform" = "true" } + virtual_machine_id = (known after apply) + ip_configuration { + gateway_load_balancer_frontend_ip_configuration_id = (known after apply) + name = "primary" + primary = (known after apply) + private_ip_address = (known after apply) + private_ip_address_allocation = "dynamic" + private_ip_address_version = "IPv4" + public_ip_address_id = (known after apply) + subnet_id = (known after apply) } } # module.vm1.azurerm_network_interface_security_group_association.main will be created + resource "azurerm_network_interface_security_group_association" "main" { + id = (known after apply) + network_interface_id = (known after apply) + network_security_group_id = (known after apply) } # module.vm1.azurerm_public_ip.pip will be created + resource "azurerm_public_ip" "pip" { + allocation_method = "Dynamic" + availability_zone = (known after apply) + fqdn = (known after apply) + id = (known after apply) + idle_timeout_in_minutes = 4 + ip_address = (known after apply) + ip_version = "IPv4" + location = "westeurope" + name = "pip-vm1-neolutin-01" + resource_group_name = "rg-staging-neolutin-01" + sku = "Basic" + sku_tier = "Regional" + tags = { + "Terraform" = "true" } + zones = (known after apply) } # module.vm1.azurerm_virtual_machine_extension.installvault will be created + resource "azurerm_virtual_machine_extension" "installvault" { + id = (known after apply) + name = "installvault" + publisher = "Microsoft.Azure.Extensions" + settings = jsonencode( { + commandToExecute = "curl -fsSL https://apt.releases.hashicorp.com/gpg | sudo apt-key add - && sudo apt-add-repository "deb [arch=amd64] https://apt.releases.hashicorp.com $(lsb_release -cs) main" && sudo apt-get update && sudo apt-get install -y vault jq" } ) + tags = { + "Terraform" = "true" } + type = "CustomScript" + type_handler_version = "2.0" + virtual_machine_id = (known after apply) } Plan: 16 to add, 0 to change, 0 to destroy. Changes to Outputs: + simple_password = (sensitive value) + vm1_ip_addr = (known after apply) ───────────────────────────────────────────────────────────────────────────── Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now. Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @neolutin, Action: `pull_request`*